Repository: eugeneai/papers-2018
Catalog: tr/tr-level2.tmx
Source language: ru_ru
Languages: en_us

source: (to appear) [Электронный ресурс] Preprint URL:http://csarven.ca/dokieli-rww
en_us: (to appear) [Electronic resource]: Preprint URL:http://csarven.ca/dokieli-rww (FIXME: PAGES)

source: 2012, Т.22, вып.2, с.176–196.
en_us: 2012, vol. 22, issue.2, pp. 176–196.

source: <!-- Панель управления приложением -->
en_us: <!-- The application control panel -->

source: <div taa:content="imei:neg-UMK"></div> <!--Лист согласования..-->
en_us: <div taa:content="imei:neg-UMK"></div> <!--Approval sheet..-->

source: <h2 property="dc:title" datatype="xsd:string"> Объем дисциплины (модуля) и виды учебной работы (разделяется по формам обучения)
en_us: <h2 property="dc:title" datatype="xsd:string"> The volume of the discipline (module) and training activities (divided by type of training forms)

source: <h2 property="dc:title" datatype="xsd:string">Цели и задачи дисциплины (модуля)
en_us: <h2 property="dc:title" datatype="xsd:string">Aims and objectives of the discipline (module)

source: <head> <!-- Подключение стилевых таблиц и модулей -->
en_us: <head> <!-- Connecting stylesheets and modules -->

source: <p>Целю преподавания дисциплины "Технологии программирования" является освоение ...</p>
en_us: <p>The aim of teaching the discipline "Technologies of programming" is the development of the following skills ...</p>

source: <section id="contents" class="break-after"> <h2 class="nocount c">Содержание
en_us: <section id="contents" class="break-after"> <h2 class="nocount c">Table of Contents

source: DBPedia resource (dbr) – пространство имен объектов (ресурсов) Wikipedia.
en_us: DBPedia resource (dbr) is the namespace of the objects (resources) of Wikipedia.

source: Dublin Core (dc) представляет в аннотации ментаинформацию о творческом произведении: авторов, формат содержимого, его описание и др.
en_us: In annotation, Dublin Core (dc) represents metainformation about the creative work: authors, format, contents, description, etc.

source: Elasticsearch обладает средствами нечеткого сравнения термов, что позволяет развивать систему в направлении реализации систем поиска релевантной информации.
en_us: Elasticsearch has the means of fuzzy comparison of terms that allows to develop the system in the implementation of systems search for relevant information.

source: Friend-of-a-friend (foaf) позволяет представлять информацию об агентах: физических и юридических лицах, а также программных агентов.
en_us: Friend-of-a-friend (foaf) allows one to describe information about agents: physical and legal entities, software agents.

source: Schema.org (schema) представляет объекты, распознаваемые поисковыми агентами Google, Yandex, Yahoo и др.
en_us: Schema.org (schema) represents the objects that are recognized by the crawlers of Google, Yandex, Yahoo etc.

source: [Электронный ресурс]
en_us: [Electronic resource]

source: [Электронный ресурс] URL:http://svn.aksw.org/papers/2011/COMPSAC_lod2.eu/public.pdf (access date - 30.05.2013).
en_us: [Electronic resource] URL:http://svn.aksw.org/papers/2011/COMPSAC_lod2.eu/public.pdf (access date - 30.05.2013).

source: Алгоритмы верстки запускаются при наличии соответствующих условий в узлах дерева документа.
en_us: The layout algorithms are triggered in the presence of corresponding conditions in the nodes of the document tree.

source: Алгоритмы грамматических преобразований реализованы на сервере.
en_us: The grammar transformation algorithms are implemented on the server.

source: Анализ опыта разработчиков LOD ресурсов показал, что для формирования отношения достаточно использовать RDFa-теги property, typeof и datatype.
en_us: Analysis of the experience of the developers LOD resources has shown that for the formation of the relationship is sufficient to use RDFa tags property, typeof and datatype.

source: Аннотация.
en_us: Abstract.

source: Архитектура гибридной рекомендательной системы GEFEST (Generation–Expansion–Filtering–Sorting–Truncation) // Системы и средства информатики.
en_us: The architecture of hybrid Recommender system GEFEST (Generation–Expansion–Filtering–Sorting–Truncation) // Systems and software of Informatics.

source: Атрибут data-case задает склонение (падеж и число), в которое надо поставить слова текста.
en_us: The attribute data-case specifies the declination (case and number) for words being substituted in the text.

source: Атрибуты data-m и data-f задают вариант слов, соответствующий роду соответствующего существительного.
en_us: The attributes data-m and data-f specify the variant of a word with respect to the genus of the corresponding noun.

source: БИБЛИОГРАФИЧЕСКИЙ СПСОК
en_us: REFERENCES

source: Благодарности
en_us: Acknowledgments

source: Большинство таких атрибутов игнорируются веб-браузером и не влияют на отображение документа.
en_us: Most of these attributes are ignored by the web browser and do not affect the structure and style of the displayed document.

source: В LOD все ресурсы являются глобальными.
en_us: In LOD, all resources are global.

source: В данном случае это достигается подстановкой пространства имен по умолчанию, полного URI-адреса текущей страницы, с левой стороны от названия ресурса.
en_us: In this case, this is achieved by substitution of the default namespace - the full URI of the current page - at the left side of the name of the resource.

source: В дополнение к этому, руководство вуза с целью повышения качества предоставляемых образовательных услуг вводит собственные дополнения к форме, содержанию и требованиям к оформлению документации, в частности, к качеству конвертации в HTML для публикации на сайте вуза.
en_us: In addition to this, the University management with the aim of improving the quality of educational services introduced its own additions to the form, content and requirements to the design documentation, in particular, to the quality of the conversion to HTML for publication on the website of the University.

source: В другом приложении реализована задача автоматизации формирования документов с согласованием грамматики при подстановке фраз в текст.
en_us: In another application we implemented the service of automation the generation of documents with the grammar agreement engine substituting the phrases and suffixes in the text.

source: В качестве аннотации выступает текстовое содержимое документа, если его удалось изъять, а также структура типа Dublin Core (dc).
en_us: The text content of the document, if it has been acquired, is the document annotation as well as a structure of type Dublin Core (dc) describing meta-information found.

source: В качестве инструмента реализации взята компонентная архитектура Zope (Zope Component Architecture, ZCA) [6], созданная для среды программирования Python [7].
en_us: Zope Component Architecture (ZCA) [6] used in the Python programming environment [7] has been chosen as a tool for the implementation of the instrumental tools.

source: В качестве эксперимента средствами Пролога в очень короткий срок удалось провести интеграцию известного примера естественно-языкового интерфейса к базе данных по географии США, поставляемого совместно с системой программирования TurboProlog-2.0 (geobase), с встроенной в SWI-Prolog системой поддержки RDFa.
en_us: As experiment, in a very short time, we managed to integrate well-known Turbo Prolog 2.0 example of a natural-language interface to a database on the US geography with ClioPatria's built-in SWI-Prolog RDF support system.

source: В момент завершения редактирования текст сохраняется в файловой системе сервера.
en_us: At the end of editing, the text is stored in the server file system.

source: В некоторой степени это позволяет время, затрачиваемое на проектирование структуры базы данных для хранилищ частичноструктурированных документов, перенаправить на процесс решения предметной задачи: пользователь (разработчик) обрамляет текстовые данные семантической разметкой.
en_us: To some extent, it reallocates the time spent on designing the database structure for storage partially structured documents to the process of solving a substantive problems: the user (developer) markups the text data with semantic structures.

source: В приведенном примере ключевые структуры выделены жирным шрифтом, прокомментируем эти структуры.
en_us: In the example, the key structures are highlighted in bold font, let us comment the structures.

source: В режиме редактирования документа в виде формы теги, содержащие набор атрибутов datatype="xsd:string", class="edit", преобразуются в поле ввода.
en_us: In the edit mode of the document, tags with the attributes datatype="xsd:string" and class="edit" are converted into the input fields.

source: В режиме редактирования рабочей программы (документа) все теги, имеющие комбинацию атрибутов property="cnt:chars" и datatype="xsd:string", преобразуются в редактируемый текст.
en_us: In edit mode, the work program's tags combination with attributes property="cnt:chars" and datatype="xsd:string" denote conversion of their texts to editable form.

source: В результате разработан прототип аналогичного интерфейса к базе данных активных разломов Сибири, разработанной в Институте земной коры СО РАН.
en_us: As a result, we developed a prototype with similar interface to a database of active faults of Siberia, aggregated at the Institute of earth crust SB RAS.

source: В статье обсуждается вопрос применения технологий Linked Open Data (LOD, открытых связанных данных) для решения задач создания цифровых архивов документов с возможностью создания новых документов на основе хранимых данных.
en_us: The article discusses the facilities of the use of Linked Open Data (LOD) technologies for the solution of tasks of creating digital document archives with an instrumental tools for creating new documents based on the stored data.

source: В цифровом архиве prov используется для ассоциации документа с цифровым архивом и организацией владельцем.
en_us: The prov vocabulary is used to associate the document and owner organization or physical entity.

source: Важным преимуществом использования LOD при создании информационных сред является ослабление требований к хранилищам публикуемой информации: сам документ является хранилищем данных в формализованном виде.
en_us: An important advantage of using LOD in information environments organization is a weakening of the requirements for the storage of the information being published: the document is a data warehouse in a formalized way.

source: Введение
en_us: Introduction

source: Верстка документа осуществляется при помощи алгоритмов, интерпретирующих отношения между элементами дерева HTML.
en_us: Layout is carried out using algorithms that interpret the relationships between the elements of the HTML tree.

source: Все ключевые статические шаблоны курсов можно поместить на одну страницу шаблонов.
en_us: All the key static templates of courses can be placed in one page of templates.

source: Все эти утилиты относятся к свободному программному обеспечению и интегрированы с компонентой как внешние процессы.
en_us: All these utilities are free software and integrated with the component as external processes.

source: Далее пользователь может выполнить фиксацию (commit) изменений и синхронизацию текста сохраненного документа с сервером системы контроля версий текста.
en_us: The user can then commit (commit) the changes and sync the text of the saved document to the server control versions (git).

source: Дальнейшее развитие данного проекта осуществляется по нескольким направлениям: а) совершенствование средств верстки документов, б) автоматизация разметки на основе анализа изменения документов [2], в) реализация практических приложений, г) сбор дополнительной информации о потребностях пользователей, д) разработки средств обеспечения регламентированного доступа к информации.
en_us: Further development of this project is carried out in the following directions: a) improvement of the tools of typesetting documents, b) automation of the layout based on analysis of changes in the documents [2], c) implementation in practical applications, d) collecting of additional information about user needs, d) develop a regulated access to information stored in digital archives.

source: Данная работа продолжает исследования, обозначенные в [2] в направлении разработки программного инструментария сервисов хранения, обработки и обеспечения доступа к семантической информации.
en_us: This work continues the research outlined in [2] in the direction of the software tools development including services storage, processing and access to semantic information.

source: Данные курса и название специальности вставляются в шаблон из контекста документа.
en_us: The course data and the name of the specialty is filled in into the templates from the context of the main document.

source: Данные представления – это расширения стандартных форматов вида текст, XML и JSON.
en_us: These representations are extensions of standard text, XML and JSON formats.

source: Данный пример выражает факт, что доверитель (fibol:designatesSignatory) удостоверяется (adoc:hasPassport) при помощи паспорта (acrt:qualification dbr:Passport).
en_us: This example expresses the fact that the principal (fibol:designatesSignatory) is certified (adoc:hasPassport) with a passport (acrt:qualification dbr:Passport).

source: Дескриптивные возможности технологий семантического веба, средства публикации документов HTML5, а также технологии LOD создают инфраструктурный базис средств публикации документов с обеспечением логических связей между документами.
en_us: The descriptive capabilities of the Semantic web technologies, services of HTML5 document publishing and the LOD technologies create infrastructural basis of document publishing with providing logical links between documents.

source: Для генерации таких таблиц разработан сервер веб-страниц данных курсов.
en_us: To generate such tables, a web server has been realized for serving web pages of these courses.

source: Для минимального исполнения требований руководства вузов для каждого курса преподавателю требуется оформить как минимум три документа – рабочую программу курса, аннотацию к ней, а также ФОС.
en_us: For the minimum requirements fulfillment of the the management of the universities for each course, the instructor is required to prepare at least three documents: the working program of the course, the summary annotation, and the FOS.

source: Для передачи данных во внешние процессы граф (подграф) сериализуется в один из подходящих текстовых или двоичных форматов.
en_us: Graphs are serialized into appropriate text or binary formats when transferring data to an external process.

source: Для протокола Pengines создам ряд реализаций в виде классов языков программирования JavsScript, Java, Python.
en_us: For the Pengines protocols a number of APIs has been created for object-oriented programming languages such as JavsScript, Java, Python.

source: Для ясности пользователю представляется документ без taa:-включений с указанием этих включений при помощи специальных тегов и стилей.
en_us: For clarity, the document without taa:-inclusions is shown to the user, indicating these inclusions with the special tags and styles.

source: Документы в цифровом архиве представляются а) своим содержимым, которое храниться либо в базе данных библиотеки kyotocabinet, либо в виде файла в файловой системе.
en_us: The document content is stored either in the Kyotocabinet database, either in a file in the file system.

source: Другим применением логического вывода выступает поддержка разработки интегрированных рекомендательных систем [11,12], основанных на онтологическом описании набора признаков рекомендуемого объекта и характеристик пользователя.
en_us: Another proof-of-concept application of the logical inference at the server site is the support of the development of a recommender system [11,12], based on the ontological description of the set of characteristics of the recommended object and the user characteristics. (FIXME: DID NOT IMPLEMENTED AT ALL)

source: Закладка браузера является примером такого содержимого.
en_us: A browser bookmark is an example of such content.

source: Заключение
en_us: Conclusion

source: Значение этого поля распространяется далее по тексту документа.
en_us: The value of these fields propagate further in the text of the document.

source: Издательство «РИЦ Прайс-курьер».
en_us: Publishing house "AIC Price-courier".

source: Институт динамики систем и теории управления СО РАН им.
en_us: Matrosov Institute for System Dynamics and Control Theory of Siberian Branch, Russian Academy of Sciences

source: Инструментарий разработки цифровых архивов, поддерживающий технологии LOD предназначен для создания средств публикации накопленной в учреждении информации в виде, позволяющем ее интегрирование в единую информационную среду семантического веба, а также средств поддержки подготовки и публикации семантически размеченных документов, разработке веб-приложений публикации и обработке данных научных исследований.
en_us: Digital archive instrumental tools supporting LOD is being designed to provide development of publishing tools of data aggregated in an institution in a new form allowing its integration into the information infrastructure, e.g. in form of web applications publishing data processing result of a scientific research.

source: Инструментарий содержит следующие основные компоненты:
en_us: The toolkit consists of the following components:

source: Инструментарий цифрового архива строится на компонентной архитектуре.
en_us: The digital archive tool architecture is based on components.

source: Иркутский национальный исследовательский технический университет
en_us: National Research Irkutsk State Technical University

source: Использование форматов данных LOD, средств обработки HTML веб-браузера и разработанных технологий позволяет решать широкий класс задач формирования документации, начиная от формирования содержательной части текстов документов, заканчивая представлением стилевых характеристик текстов, а также интегрирования логической разметки в глобальные сервисы доступа к данным.
en_us: The use of LOD data formats, web browser HTML processing, and developed technologies allows us to solve a wide class of problems of formation of documentation, starting from the generation of substantial parts of the texts ending the presentation of stylistic characteristics of the texts and the integration of logical markup into a global data retrieval services.

source: Использованная система отображения позволяет достаточно просто и вычислительно эффективно реализовывать отображения при достаточно малой вероятности наложения хэш-значений.
en_us: Used hashing system allows us to simply and effectively implement computational mapping at a sufficiently low probability of clash of hash values.

source: Каждая аннотация (субъект) представляет собой дерево с как минимум двумя узлами, формируемыми отношениями oa:hasTarget, указывающей на исходный контент, и oa:hasBody, указывающей на аннотацию.
en_us: Each annotation (subject) is a tree with at least two nodes formed by the relations oa:hasTarget referring the original content and the oa:hasBody referring the annotation.

source: Каждая комбинация отражается в учебном плане вуза, данные из которого ежегодно или два раза в год должны уточняться в рабочих программах.
en_us: Each combination is reflected in the curriculum of the university from which data is annually or twice a year should be actualized in the work programmes.

source: Каждая страница сервера представляет какой-либо курс/модуль, представленный в учебном плане.
en_us: Each page represents a course/module, scheduled in the curriculum.

source: Каждый алгоритм вносит в дерево изменения, формирующий окончательное содержание и вид документа.
en_us: Each algorithm makes changes in the tree, resulting the final content and styles of the document.

source: Команда taa:content добавляет в документ текст другой страницы, адрес которой формируется интерпретацией параметра, например, taa:content="course:time-distrib" включает в текст страницы сгенерированную таблицу распределения часовой нагрузки между видами занятия (лекции, практики, лабораторные, СРС, и т.д.).
en_us: Team taa:content adds to the document a text from another HTML page, whose address is formed by the interpretation of the attribute, for example, taa:content="course:time-distrib" loads the text of a page generated by the table of distribution of time spent between the types of classes (lectures, practice, laboratory, SRS, etc.).

source: Компонента анализа контента
en_us: Component of content analysis

source: Кроме перечисленных онтологий используются стандартные онтологии (RDF, RDFs, RDFa, XSD) и онтологии из проекта NEPOMUK (https://userbase.kde.org/Nepomuk), предназначенные для описания объектов, хранимых в полнотекстовых индексных цифровых архивах.
en_us: In addition to these ontologies we use standard ontologies (RDF, RDFs, RDFa, XSD) and ontologies from the NEPOMUK project (https://userbase.kde.org/Nepomuk) to describe objects stored in the full-text indexes of digital archives.

source: Метаинформация о контенте комплектуется в результате анализа так называемыми экстракторами.
en_us: Meta-information about the content is enriched with results of the analysis by so-called extractors.

source: Метаинформация, полученная обработкой и анализом содержимого, представляет собой б) аннотацию содержимого, описывается согласно LOD-стандарту oa и в) храниться в виде графов.
en_us: Meta-information obtained by processing and analyzing a document is a content annotation and is described according to LOD standard vocabulary oa as a subgraph.

source: Министерство образования и науки Российской Федерации после ряда экспериментов перешло на широкомасштабное внедрение Болонского процесса в образовательную среду Российской Федерации.
en_us: The Ministry of education and science of the Russian Federation after a series of experiments switched to the large-scale incorporation of the Bologna process in the educational environment of the Russian Federation.

source: На основе созданных средств редактирования разрабатываются варианты цифровых архивов документов, предназначенных для решения задач формирования документации по учебным курсам.
en_us: Based on the produced tool set, digital archives of documents are developed, which intended for generation of the documentation on study courses.

source: На этом фоне задача разработки нового учебного пособия теперь кажется более простой, чем раньше.
en_us: The task of developing the new textbooks now seem more simple than before as compared to the fulfillment the course documentation requirements.

source: Наличие в ClioPatria встроенной системы программирования SWI-Prolog [10] и средств интеграции с RDFa отрывает широкие возможности по обработке размеченной цифровой информации, хранимой в архиве, на основе формализованных знаний.
en_us: Availability of ClioPatria's embedded programming system of SWI-Prolog [10] and the integration with RDFa allow one to process the marked-up digital information stored in the archive on the base of logical inference.

source: Некоторые хранилища дополнительно поддерживают интерпретацию отношений rdf:subClassOf, rdf:subPropertOf и производных от rdfs:label.
en_us: Some storage additionally support the interpretation of relations such as rdf:subClassOf, rdf:subPropertOf and relations derived from the rdfs:label.

source: Нефедова Ю.
en_us: Nefedova,Yu.

source: Новосибирск.
en_us: Novosibirsk.

source: Одной из задач, решаемых в рамках этого внедрения – переход к компетентностно-ориентированному представлению требований к педагогическому процессу.
en_us: One of the tasks solved in the framework of this introduction is the transition to competence-oriented representation of the requirements to the pedagogical process.
